#ifndef  _TG_WINDOWS_H
#define  _TG_WINDOWS_H

#include "stdint.h"

/* 定义窗口数据结构 */
struct tg_window
{  
	uint32_t x;				// 窗口位置(左上角的x坐标)
	uint32_t y;				// 窗口位置(左上角的y坐标)

	uint32_t width;			// 窗口宽度
	uint32_t height;		// 窗口高度
	uint32_t itemsperpage;	// 窗口可显示项目个数
	uint32_t topitem;		//最顶端的条目
	char *title;	// 定义标题栏指针
} ;
typedef struct tg_window* tg_window_t;


/****************************************************************************
* 名称：tg_windows_draw()
* 功能：显示窗口。根据提供的窗口参数进行画窗口
* 入口参数：dat		填充的数据(对于黑白色LCM，为0的点灭，为1的点显示)
* 出口参数：返回0表示操作失败，返回1表示操作成功
****************************************************************************/
uint8_t  tg_windows_draw(tg_window_t win);



/****************************************************************************
* 名称：GUI_WindowsHide()
* 功能：消隐窗口。
* 入口参数：win		窗口句柄
* 出口参数：返回0表示操作失败，返回1表示操作成功
****************************************************************************/
uint8_t  tg_windows_delete(tg_window_t win);



/****************************************************************************
* 名称：tg_windows_clr()
* 功能：清屏窗口。
* 入口参数：win		窗口句柄
* 出口参数：无
* 说明：使用此函数前要先使用tg_windows_draw()将窗口画出。
****************************************************************************/
void  tg_windows_clr(tg_window_t win);

#endif
